metaneutrons/Vellum/firmware/sdkconfig.defaults.s3
# Vellum Firmware — ESP32-S3 (E-Paper: E1001, E1002, E1003)
CONFIG_IDF_TARGET="esp32s3"

# ALL THREE E-Series models expose UART0 through an onboard CH34x bridge, not
# the S3's native USB-Serial-JTAG: E1001 + E1002 use a CH340C, E1003 a CH340K
# (hardware-confirmed 2026-08-12). Each therefore carries a model overlay
# (sdkconfig.defaults.e1001/.e1002/.e1003) that replaces the default below, and
# every model MUST have one — E1001 shipped without an overlay and inherited
# this default, which put its console and Improv frames on a USB peripheral that
# is not wired to the connector, so USB provisioning could not work at all.
# The JTAG default is kept only as the sane base for a hypothetical native-USB
# S3 board; P4 (sdkconfig.defaults.p4) genuinely uses native USB-Serial-JTAG.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Flash / partition
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# NVS
CONFIG_NVS_ENCRYPTION=n

# Wi-Fi (native, no remote)
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
# Keep WPA3-Personal support explicit instead of relying on ESP-IDF defaults.
# Vellum accepts both legacy SAE Hunt-and-Peck and WPA3 H2E, including the
# compatibility mode used by access points during WPA2/WPA3 transitions.
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=y
CONFIG_ESP_WIFI_ENABLE_SAE_H2E=y
CONFIG_ESP_WIFI_ENABLE_SAE_PK=y
CONFIG_ESP_WIFI_WPA3_COMPATIBLE_SUPPORT=y

# Sleep
CONFIG_PM_SLP_IRAM_OPT=n

# HTTP server (captive portal)
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

# HTTP client — enterprise transport: HTTPS required, validate the server
# certificate against the bundled CA roots (esp_crt_bundle). The firmware
# refuses to send the device token over plaintext.
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
# Support modern public-CA chains that include a cross-signed root (for
# example the current Let's Encrypt YR chain) without weakening validation.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_CROSS_SIGNED_VERIFY=y

# Secure TLS requires a valid clock. Prefer NTP advertised by DHCP (option 42)
# and retain room for public fallback servers on networks without that option.
CONFIG_LWIP_DHCP_GET_NTP_SRV=y
CONFIG_LWIP_DHCP_MAX_NTP_SERVERS=1
CONFIG_LWIP_SNTP_MAX_SERVERS=3

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30

# PSRAM (8MB on reTerminal E-Series)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256

# Main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# LVGL
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# OTA rollback (see ota_manager_mark_valid)
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
